In [1]:
import pandas as pd

* DATAFRAMES

In [2]:
a = pd.DataFrame()
print(a)

Empty DataFrame
Columns: []
Index: []

In [3]:
lst =[1,2,3]

In [4]:
df1=pd.DataFrame(lst) # creation of dataframe

In [5]:
df1

   0
0  1
1  2
2  3

In [6]:
print(df1)

   0
0  1
1  2
2  3

In [7]:
ls_of_ls=[[1,2,3],[2,3,4],[4,5,6]]

In [8]:
print(ls_of_ls)

[[1, 2, 3], [2, 3, 4], [4, 5, 6]]

In [9]:
df2=pd.DataFrame(ls_of_ls)
df2

   0  1  2
0  1  2  3
1  2  3  4
2  4  5  6

In [10]:
d1 = {'ID':[11,22,33,44]}
d1

{'ID': [11, 22, 33, 44]}

In [11]:
df3=pd.DataFrame(d1)
df3

   ID
0  11
1  22
2  33
3  44

In [12]:
d2={'A':[11,22,33], 'B':[44,55,66]} 
# both the variable should be same length (as A and B)
d2

{'A': [11, 22, 33], 'B': [44, 55, 66]}

In [13]:
df4=pd.DataFrame(d2)
df4

    A   B
0  11  44
1  22  55
2  33  66

In [14]:
ls_dict = [{'a':1, 'b':3},{'a':2, 'b':4,}]
df5 = pd.DataFrame(ls_dict)
df5

   a  b
0  1  3
1  2  4

In [15]:
ls_dict = [{'a':1, 'b':3},{'a':2, 'b':4,'c':6}]
df5 = pd.DataFrame(ls_dict)
df5

   a  b    c
0  1  3  NaN
1  2  4  6.0

In [18]:
d_ser = {'A':pd.Series([1,2,3]),'B':pd.Series([111,222,333])}
df6 = pd.DataFrame(d_ser)
df6

   A    B
0  1  111
1  2  222
2  3  333